create table board(
id int auto_increment primary key,
gid int,
seq int,
lev int,
cnt int,
title varchar(200),
content varchar(999),
pname varchar(200),
pw varchar(100),
upfile varchar(100),
reg_date datetime
);


insert into board
(id,gid,seq,lev,cnt,title,content,pname,pw,upfile,reg_date) values
(1,1,0,0,0,'첫번째제목','첫번째내용','박범수','1111','9.gif','2025-06-10');

insert into board
(id,gid,seq,lev,cnt,title,content,pname,pw,upfile,reg_date) values
(19,19,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(20,20,0,0,0,'두번째제목','두번째내용','김범수','1111',null,'2025-06-12'),
(21,21,0,0,0,'세번째제목','세번째내용','이범수','1111',null,'2025-06-13'),
(22,22,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(23,23,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(24,24,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(25,25,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(26,26,0,0,0,'두번째제목','두번째내용','김범수','1111',null,'2025-06-12'),
(27,27,0,0,0,'세번째제목','세번째내용','이범수','1111',null,'2025-06-13'),
(28,28,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(29,29,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(30,30,0,0,0,'두번째제목','두번째내용','김범수','1111',null,'2025-06-12'),
(31,31,0,0,0,'세번째제목','세번째내용','이범수','1111',null,'2025-06-13'),
(32,32,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(33,33,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(34,34,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(35,35,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(36,36,0,0,0,'두번째제목','두번째내용','김범수','1111',null,'2025-06-12'),
(37,37,0,0,0,'세번째제목','세번째내용','이범수','1111',null,'2025-06-13'),
(38,38,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(39,39,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(40,40,0,0,0,'두번째제목','두번째내용','김범수','1111',null,'2025-06-12'),
(41,41,0,0,0,'세번째제목','세번째내용','이범수','1111',null,'2025-06-13'),
(42,42,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(43,43,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(44,44,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(45,45,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(46,46,0,0,0,'두번째제목','두번째내용','김범수','1111',null,'2025-06-12'),
(47,47,0,0,0,'세번째제목','세번째내용','이범수','1111',null,'2025-06-13'),
(48,48,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(49,49,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(50,50,0,0,0,'두번째제목','두번째내용','김범수','1111',null,'2025-06-12'),
(51,51,0,0,0,'세번째제목','세번째내용','이범수','1111',null,'2025-06-13'),
(52,52,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(53,53,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(54,54,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(55,55,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(56,56,0,0,0,'두번째제목','두번째내용','김범수','1111',null,'2025-06-12'),
(57,57,0,0,0,'세번째제목','세번째내용','이범수','1111',null,'2025-06-13'),
(58,58,0,0,0,'네번째제목','네번째내용','모범수','1111',null,'2025-06-14'),
(59,59,0,0,0,'다섯번째제목','다섯번째내용','노범수','1111',null,'2025-06-21'),
(60,60,0,0,0,'두번째제목','두번째내용','김범수','1111',null,'2025-06-12');

select * from board where id = 2;

-- 조회수 증가
update board set cnt = cnt + 1 where id = 3;

-- 수정
update board set pname ='변경작성자', title='변경제목', content='변경내용', cnt =  cnt - 1
where id = 2 and pw ='1111';

--  답변 기존글 수정
update board set seq = seq + 1 where gid = 5 and seq > 1;

update board set title = concat(title, id) ;

select * from board;

